{
  "2025": {
    "Rat": {
      "overall": "2025 is a promising year for Rats. Your natural intelligence and adaptability will help you navigate challenges and seize opportunities. This is a good year for personal growth and career advancement.",
      "career": "Career prospects are favorable. Your quick thinking and resourcefulness will be recognized by superiors. Consider taking on new responsibilities or projects that showcase your skills.",
      "relationships": "Relationships will flourish with open communication. Single Rats may meet someone special through work or social connections. Existing relationships will deepen with mutual understanding.",
      "health": "Pay attention to your nervous system and digestive health. Regular exercise and stress management techniques will help maintain your well-being. Ensure you get adequate rest."
    },
    "Ox": {
      "overall": "2025 brings stability and steady progress for Oxen. Your persistence and methodical approach will yield positive results. Focus on long-term goals rather than quick gains.",
      "career": "Career development looks promising. Your reliability and hard work will be rewarded. Consider upgrading your skills or knowledge to enhance your professional value.",
      "relationships": "Relationships require patience and understanding. Single Oxen may find potential partners who appreciate their dependable nature. Existing relationships will strengthen through shared goals.",
      "health": "Monitor your cardiovascular health. Regular check-ups and a balanced diet are recommended. Incorporate relaxation techniques to manage stress levels."
    },
    "Tiger": {
      "overall": "2025 is a dynamic year for Tigers. Your natural leadership and courage will help you overcome obstacles. Embrace new challenges and opportunities for personal growth.",
      "career": "Career advancement is likely. Your bold ideas and decisive actions will catch attention. Consider taking calculated risks that align with your long-term vision.",
      "relationships": "Relationships may experience some intensity. Single Tigers might attract strong personalities. Existing relationships will benefit from balancing independence with togetherness.",
      "health": "Focus on maintaining energy levels. Regular physical activity and adequate sleep are essential. Pay attention to joint and muscle health."
    },
    "Rabbit": {
      "overall": "2025 offers harmony and peace for Rabbits. Your diplomatic skills and intuition will guide you through the year. Focus on creating balance in all aspects of life.",
      "career": "Career growth comes through collaboration. Your ability to work well with others will open doors. Consider roles that utilize your communication and negotiation skills.",
      "relationships": "Relationships will be a source of joy. Single Rabbits may find gentle, compatible partners. Existing relationships will flourish with mutual respect and care.",
      "health": "Prioritize emotional well-being. Gentle exercise like yoga or tai chi is beneficial. Pay attention to digestive health and maintain a balanced diet."
    },
    "Dragon": {
      "overall": "2025 brings exciting opportunities for Dragons. Your charisma and confidence will attract success. Embrace your natural leadership abilities while remaining open to advice.",
      "career": "Career prospects are excellent. Your innovative ideas and enthusiasm will be well-received. Consider positions that allow you to showcase your creativity and vision.",
      "relationships": "Relationships will be vibrant and engaging. Single Dragons may attract admirers with their magnetic personality. Existing relationships will benefit from shared adventures.",
      "health": "Maintain balance between activity and rest. Regular exercise is important, but avoid overexertion. Pay attention to throat and respiratory health."
    },
    "Snake": {
      "overall": "2025 is a year of wisdom and insight for Snakes. Your intuition and analytical skills will guide you to make sound decisions. Focus on personal development and learning.",
      "career": "Career advancement comes through strategic thinking. Your ability to see the bigger picture will be valuable. Consider roles that utilize your planning and analytical skills.",
      "relationships": "Relationships require openness and trust. Single Snakes may find intellectually stimulating partners. Existing relationships will deepen through meaningful conversations.",
      "health": "Focus on circulation and skin health. Regular moderate exercise and proper hydration are recommended. Practice mindfulness to maintain mental clarity."
    },
    "Horse": {
      "overall": "2025 offers freedom and progress for Horses. Your energy and enthusiasm will drive success in various endeavors. Embrace opportunities for travel and new experiences.",
      "career": "Career growth comes through networking and visibility. Your dynamic presence and quick thinking will be assets. Consider roles that offer variety and movement.",
      "relationships": "Relationships thrive with honest communication. Single Horses may meet someone who matches their energy and passion. Existing relationships benefit from shared activities.",
      "health": "Maintain cardiovascular health through regular exercise. Pay attention to your nervous system and practice stress-reduction techniques. Ensure adequate hydration."
    },
    "Goat": {
      "overall": "2025 brings creativity and harmony for Goats. Your artistic sensibilities and compassionate nature will be highlighted. Focus on nurturing relationships and creative pursuits.",
      "career": "Career development comes through creative solutions. Your unique perspective will be valued. Consider roles that allow you to express your artistic or humanitarian interests.",
      "relationships": "Relationships will be nurturing and supportive. Single Goats may find partners who appreciate their gentle nature. Existing relationships deepen through emotional connection.",
      "health": "Focus on digestive health and emotional well-being. Gentle exercise and a balanced diet are recommended. Practice self-care routines that promote relaxation."
    },
    "Monkey": {
      "overall": "2025 is a year of clever solutions and adaptability for Monkeys. Your wit and versatility will help you navigate changing circumstances. Embrace opportunities for learning and growth.",
      "career": "Career prospects are favorable. Your problem-solving abilities and quick thinking will be assets. Consider roles that challenge your intellect and creativity.",
      "relationships": "Relationships benefit from playfulness and humor. Single Monkeys may attract partners who appreciate their wit and charm. Existing relationships thrive with shared intellectual interests.",
      "health": "Maintain nervous system health through balanced activities. Regular exercise and mental challenges are beneficial. Pay attention to sleep quality and stress management."
    },
    "Rooster": {
      "overall": "2025 offers precision and achievement for Roosters. Your attention to detail and work ethic will lead to success. Focus on setting clear goals and following through with determination.",
      "career": "Career advancement comes through diligence and organization. Your meticulous approach will be recognized. Consider roles that utilize your analytical and planning skills.",
      "relationships": "Relationships require honesty and clear communication. Single Roosters may find partners who value reliability and integrity. Existing relationships strengthen through mutual respect.",
      "health": "Focus on digestive health and stress management. Regular exercise and a structured routine are beneficial. Pay attention to maintaining work-life balance."
    },
    "Dog": {
      "overall": "2025 brings loyalty and justice for Dogs. Your honest nature and sense of fairness will guide you through challenges. Focus on building trustworthy relationships and standing up for your beliefs.",
      "career": "Career growth comes through integrity and teamwork. Your reliability and protective nature will be valued. Consider roles that align with your ethical standards.",
      "relationships": "Relationships thrive with loyalty and trust. Single Dogs may find partners who share their values and principles. Existing relationships deepen through mutual support during challenges.",
      "health": "Maintain immune system health through regular exercise and proper nutrition. Pay attention to digestive health and stress levels. Ensure adequate rest and relaxation."
    },
    "Pig": {
      "overall": "2025 offers abundance and joy for Pigs. Your generous nature and optimism will attract positive experiences. Focus on enjoying life's pleasures while maintaining practical considerations.",
      "career": "Career prospects are favorable. Your honesty and diligence will be appreciated. Consider roles that allow you to help others while providing stability and security.",
      "relationships": "Relationships will be warm and nurturing. Single Pigs may find partners who appreciate their generosity and sincerity. Existing relationships flourish with shared enjoyment of life's pleasures.",
      "health": "Focus on maintaining a balanced diet and regular exercise routine. Pay attention to kidney and liver health. Practice moderation in all indulgences for optimal well-being."
    }
  }
}
